Revit 2027 API
View3D.SaveOrientation Method
 Converts the temporary orientation of the View3D into its saved orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SaveOrientation()
Public Sub SaveOrientation
public:
void SaveOrientation()
member SaveOrientation : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The orientation of the View3D cannot be saved.
Remarks
 The View3D will be oriented to its saved orientation on file open. To save the orientation of the default View3D, first rename the default View3D.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace